In [1]:
import pandas as pd
import numpy as np
import itertools

from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression

from sklearn.metrics import roc_curve, auc
from sklearn.metrics import confusion_matrix

import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
!ls

README.md                 scac.csv
all_stocks_5yr.csv        stock-fraud-predict.ipynb

In [3]:
df = pd.read_csv('scac.csv')

In [4]:
df.head()

,filing_name,filing_date,district_court,exchange,ticker
0,"ILG, Inc.",07/06/2018,D. Delaware,NASDAQ,ILG
1,KLX Inc.,07/06/2018,D. Delaware,NASDAQ,KLXI
2,Triangle Capital Corporation,07/06/2018,E.D. North Carolina,New York SE,TCAP
3,Vectren Corporation,07/05/2018,S.D. Indiana,New York SE,VVC
4,DCT Industrial Trust Inc.,07/02/2018,D. Colorado,New York SE,DCT

In [5]:
df1 = pd.read_csv('all_stocks_5yr.csv')

In [6]:
df1.head()

         date   open   high    low  close    volume Name
0  2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1  2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2  2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3  2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4  2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL

In [11]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 619040 entries, 0 to 619039
Data columns (total 7 columns):
date      619040 non-null object
open      619029 non-null float64
high      619032 non-null float64
low       619032 non-null float64
close     619040 non-null float64
volume    619040 non-null int64
Name      619040 non-null object
dtypes: float64(4), int64(1), object(2)
memory usage: 33.1+ MB

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4996 entries, 0 to 4995
Data columns (total 5 columns):
filing_name       4996 non-null object
filing_date       4996 non-null object
district_court    4996 non-null object
exchange          4996 non-null object
ticker            4996 non-null object
dtypes: object(5)
memory usage: 195.2+ KB

In [16]:
df1.rename(columns={'Name':'ticker'}, inplace=True)

In [17]:
df1.head()

         date   open   high    low  close    volume ticker
0  2013-02-08  15.07  15.12  14.63  14.75   8407500    AAL
1  2013-02-11  14.89  15.01  14.26  14.46   8882000    AAL
2  2013-02-12  14.45  14.51  14.10  14.27   8126000    AAL
3  2013-02-13  14.30  14.94  14.25  14.66  10259500    AAL
4  2013-02-14  14.94  14.96  13.16  13.99  31879900    AAL

In [21]:
df_merge = pd.merge(df, df1, on='ticker')

In [19]:
df.head()

,filing_name,filing_date,district_court,exchange,ticker
0,"ILG, Inc.",07/06/2018,D. Delaware,NASDAQ,ILG
1,KLX Inc.,07/06/2018,D. Delaware,NASDAQ,KLXI
2,Triangle Capital Corporation,07/06/2018,E.D. North Carolina,New York SE,TCAP
3,Vectren Corporation,07/05/2018,S.D. Indiana,New York SE,VVC
4,DCT Industrial Trust Inc.,07/02/2018,D. Colorado,New York SE,DCT

In [20]:
df1.head()

         date   open   high    low  close    volume ticker
0  2013-02-08  15.07  15.12  14.63  14.75   8407500    AAL
1  2013-02-11  14.89  15.01  14.26  14.46   8882000    AAL
2  2013-02-12  14.45  14.51  14.10  14.27   8126000    AAL
3  2013-02-13  14.30  14.94  14.25  14.66  10259500    AAL
4  2013-02-14  14.94  14.96  13.16  13.99  31879900    AAL

In [22]:
df_merge.head()

,filing_name,filing_date,district_court,exchange,ticker,date,open,high,low,close,volume
0,Express Scripts Holding Company,06/22/2018,E.D. Missouri,NASDAQ,ESRX,2013-02-08,55.27,55.92,55.12,55.74,3413611
1,Express Scripts Holding Company,06/22/2018,E.D. Missouri,NASDAQ,ESRX,2013-02-11,56.04,56.04,54.88,55.05,3512527
2,Express Scripts Holding Company,06/22/2018,E.D. Missouri,NASDAQ,ESRX,2013-02-12,55.01,55.29,54.24,54.34,5723673
3,Express Scripts Holding Company,06/22/2018,E.D. Missouri,NASDAQ,ESRX,2013-02-13,54.35,55.47,54.35,55.43,4581808
4,Express Scripts Holding Company,06/22/2018,E.D. Missouri,NASDAQ,ESRX,2013-02-14,55.26,55.88,55.10,55.10,7916922

In [27]:
df_merge.district_court.value_counts()

S.D. New York          117356
N.D. California         63481
D. New Jersey           27397
C.D. California         25761
D. Massachusetts        22662
N.D. Illinois           22662
D. Minnesota            18885
D. Connecticut          16367
S.D. Ohio               12590
E.D. Missouri           11331
E.D. Michigan           11331
D. Colorado             10369
N.D. Georgia            10072
D. Delaware              9773
S.D. California          8813
E.D. Pennsylvania        8813
M.D. Tennessee           7851
W.D. Washington          7554
S.D. Florida             7554
N.D. Texas               7464
N.D. Ohio                6295
E.D. New York            6295
W.D. Oklahoma            5036
D. Nevada                4338
E.D. Virginia            4305
D. Rhode Island          3777
E.D. Tennessee           3777
S.D. Texas               3777
W.D. Missouri            3777
W.D. Kentucky            3777
S.D. Indiana             3777
D. Oregon                2518
D. South Carolina        2518
M.D. Florida             2518
N.D. Alabama             2518
D. Nebraska              2518
D. Maine                 2518
E.D. Wisconsin           2518
W.D. Arkansas            2518
W.D. Pennsylvania        2518
D. Maryland              1723
S.D. Illinois            1259
E.D. Arkansas            1259
N.D. Oklahoma            1259
M.D. North Carolina      1259
W.D. Michigan            1259
W.D. North Carolina      1259
M.D. Georgia             1259
D. Arizona               1259
W.D. Wisconsin           1259
N.D. Iowa                1259
D. Idaho                 1259
W.D. New York            1259
W.D. Texas               1259
N.D. Indiana             1259
Name: district_court, dtype: int64